{
  "products": [
    {
      "id": 1,
      "name": "Nike Air Force 1 '07 Craft",
      "type": "Shoes",
      "rating": 4,
      "color": ["red","black","crimson","white"],
      "sale_price": 0,
      "price": 79,
      "image": "Nike_Air_Force_1_'07_Craft.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The legend lives on in the Nike Air Force 1 '07 Craft—a modern take on the iconic AF-1 with new details like fresh graphics on the tongue and heel. Crisp leather, brushed suede and exposed stitching on the upper add texture and depth while the new plush liner feels soft and comfortable. Its redesigned shape returns to OG roots, adding heritage style."
    },
    {
      "id": 2,
      "name": "Zoom Pegasus 38",
      "type": "Shoes",
      "rating": 3,
      "color": ["red","crimson","teal"],
      "sale_price": 24,
      "price": 120,
      "image": "air-zoom-pegasus-38-mens-road-running-shoes-lq7PZZ.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The road is your runway. Get ready to take flight in the workhorse with wings. Back with extra bounce that’s perfect for hitting the pavement. Whether you’re racking up everyday miles or on your long run, feel the spring in your step with the same cushioned support as its predecessor. Breathable mesh in the upper combines the comfort and durability you want with a wider fit at the toes."
    },
    {
      "id": 3,
      "name": "Nike Dunk High Retro SE",
      "type": "Shoes",
      "rating": 5,
      "color": ["lightblue","white","crimson","blue"],
      "sale_price": 46,
      "price": 56,
      "image": "Nike_Dunk_High_Retro_SE.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Go full throttle in the Nike Dunk Low High Retro.It brings motocross-inspired details like bold branding, reflective accents and fresh materials to the wardrobe favourite.Crisp leather, bright panels and flashy details deliver high-octane energy."
    },
    {
      "id": 4,
      "name": "Air Max 270",
      "type": "Shoes",
      "rating": 2,
      "color": ["orange","black","crimson","teal"],
      "sale_price": 105,
      "price": 170,
      "image": "air-max-270-mens-shoes-KkLcGR.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Enjoy the sleek design of the Nike Air Max 270 in bright, warm hues. An extra-large Max Air unit provides ultra-plush cushioning under every step and a dramatic style statement, while the stretchy inner sleeve provides a snug, socklike fit that's sure to keep you comfortable all day, every day."
    },
    {
      "id": 5,
      "name": "Nike Blazer Mid '77 Jumbo",
      "type": "Shoes",
      "rating": 3,
      "color": ["black","white"],
      "sale_price": 58,
      "price": 70,
      "image": "Nike_Blazer_Mid_'77_Jumbo.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Praised by many for its enduring look and feel, the wardrobe staple hits refresh with the Nike Blazer Mid '77 Jumbo.Harnessing the old-school look you love, it now has an elastic heel with corduroy-like texture and large pull tabs for easy on and off.The oversized Swoosh design and jumbo laces add a fun twist."
    },
    {
      "id": 6,
      "name": "VaporMax 2021 FK",
      "type": "Shoes",
      "rating": 4,
      "color": ["orange","black","crimson","teal"],
      "sale_price": 0,
      "price": 210,
      "image": "air-vapormax-plus-mens-shoes-nC0dzF.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Made from at least 20% recycled materials by weight, the Nike Air VaporMax 2021 FK is airy and easy to wear with superstretchy, recycled Flyknit fabric (plus a soft collar that sculpts your ankle). The stitched-on Swoosh and recycled TPU heel clip add a splash of intrigue as you float down the streets on incredibly soft VaporMax cushioning."
    },
    {
      "id": 7,
      "name": "Nike Go FlyEase",
      "type": "Shoes",
      "rating": 2,
      "color": ["blue","white"],
      "sale_price": 10,
      "price": 19,
      "image": "Nike_Go_FlyEase.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Just when you thought you'd seen it all, Nike wows with an all-new way to quickly and easily get into your shoes.The entire heel (including the sole) of the Nike Go FlyEase hinges open for a totally hands-free entry.Slip in, step down and presto!You're all set."
    },
    {
      "id": 8,
      "name": "Air Max 90",
      "type": "Shoes",
      "rating": 1,
      "color": ["black","white"],
      "sale_price": 120,
      "price": 130,
      "image": "air-max-90-mens-shoes-6n3vKB.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Nothing as fly, nothing as comfortable, nothing as proven—the Nike Air Max 90 stays true to its roots with the iconic Waffle sole, stitched overlays and classic TPU accents. Fresh details give a modern look while Max Air cushioning adds comfort to your journey."
    },
    {
      "id": 9,
      "name": "Nike Waffle Debut",
      "type": "Shoes",
      "rating": 5,
      "color": ["black","lightblue","black"],
      "sale_price": 0,
      "price": 22,
      "image": "Nike_Waffle_Debut.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Retro gets modernised in the Nike Waffle Debut. Remember that smooth suede and nylon trend? It's back, along with the modernised 'wedge' midsole that feels incredibly plush. And to top it off, we've kept the classic on the bottom—the tried, true and trusted Waffle outsole—that adds traction, durability and heritage style to your step."
    },
    {
      "id": 10,
      "name": "Pegasus Trail 3 GORE-TEX",
      "type": "Shoes",
      "rating": 4,
      "color": ["white"],
      "sale_price": 125,
      "price": 160,
      "image": "pegasus-trail-3-gore-tex-mens-running-shoes-HG005k.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Over the river and through the woods, you're ready for it all. These trail running shoes have improved structure and durability while maintaining flexibility wherever your run takes you. Lugs and improved traction help keep you steady on rough terrain. The water-resistant upper helps keep you moving on rocky trails even when stormy conditions try to slow you down. Don't let the rain stop you, lace up and take on the elements."
    },
    {
      "id": 11,
      "name": "Nike Air Max 270 G",
      "type": "Shoes",
      "rating": 4,
      "color": ["black","green"],
      "sale_price": 70,
      "price": 75,
      "image": "Nike_Air_Max_270_G.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Look legendary in the Nike Air Max 270 G. The silhouette is a stitch-for-stitch reconstruction of the original big Air icon, with the addition of breathable mesh and innovative traction that performs at the highest level of play."
    },
    {
      "id": 12,
      "name": "React Infinity Run Flyknit 2",
      "type": "Shoes",
      "rating": 5,
      "color": ["Pink","red","black"],
      "sale_price": 0,
      "price": 150,
      "image": "react-infinity-run-flyknit-2-mens-road-running-shoes-DttDF2.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The Nike React Infinity Run Flyknit 2 continues to help keep you running. A refreshed upper uses Flywire technology that combines with Flyknit for support and breathability where you need it. The high foam heights provide soft responsiveness and long-lasting comfort, plus a wider forefoot for added stability. It's still one of our most tested shoes, designed to help you feel the potential when your foot hits the pavement."
    },
    {
      "id": 13,
      "name": "Nike ZoomX Vaporfly Next% 2",
      "type": "Shoes",
      "rating": 3,
      "color": ["Pink","red","black"],
      "sale_price": 13,
      "price": 18,
      "image": "Nike_ZoomX_Vaporfly_Next_2.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Continue the next evolution of speed with a racing shoe made to help you chase new goals and records. It helps improve comfort and breathability with a redesigned upper. From a 10K to a marathon, this model, like the previous version, has the responsive cushioning and secure support to push you towards your personal best."
    },
    {
      "id": 14,
      "name": "Nike SuperRep Go 3 Next Nature Flyknit",
      "type": "Shoes",
      "rating": 2,
      "color": ["white","blue"],
      "sale_price": 80,
      "price": 89,
      "image": "Nike_SuperRep_Go_3_Next_Nature_Flyknit.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The new Nike SuperRep Go 3 Flyknit Shoe is a radical design story rooted in sustainability and innovation. The zoned Flyknit construction wraps your foot in 360 degrees of comfort and support. A finely ground, reclaimed foam midsole gives you responsive cushioning for high-impact training. The lightweight, packable design lets you keep them close, no matter where your next workout takes you."
    },
    {
      "id": 15,
      "name": "Air Jordan XXXVI SE",
      "type": "Shoes",
      "rating": 5,
      "color": ["orange","black"],
      "sale_price": 20,
      "price": 25,
      "image": "Air_Jordan_XXXV_SE.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Breaking barriers and making history as the first Japanese-born player to be a first-round draft pick is just the start for Rui Hachimura. With the world's biggest games in his home country for the first time in over 50 years, Rui knows he's here for a reason. Inspired by all of the places Rui can take basketball, the Air Jordan XXXVI SE 'Black Samurai' celebrates the purpose and pride that comes with repping your country's colours."
    },
    {
      "id": 16,
      "name": "Nike Streetgato",
      "type": "Shoes",
      "rating": 2,
      "color": ["Yellow","blue"],
      "sale_price": 0,
      "price": 26,
      "image": "Nike_Streetgato.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Rule the streets in the Nike Streetgato.They blend performance details with streetwear flair so you can be ready to play at any moment."
    },
    {
      "id": 17,
      "name": "Nike Aqua Rift Premium",
      "type": "Shoes",
      "rating": 3,
      "color": ["red","blue"],
      "sale_price": 50,
      "price": 69,
      "image": "Nike_Aqua_Rift_Premium.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Step into summer with a shoe that blends features from 2 '90s classics to create something both retro and futuristic. The iconic split toe of the Nike Air Rift gives you flexible comfort (and a look unlike anything else on the streets), while exaggerated shapes from the Nike Aqua line bring an ultra-modern feel. Slip them on and feel free to splash through whatever adventures you find."
    },
    {
      "id": 18,
      "name": "Nike Aqua Rift Premium",
      "type": "Shoes",
      "rating": 5,
      "color": ["red","yellow","green","pink"],
      "sale_price": 100,
      "price": 109,
      "image": "Nike_Air_Presto_x_Hello_Kitty.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Let myth become reality and step into a world of rainbows and sunshine with the Nike Air Presto x Hello Kitty. From the custom-moulded Hello Kitty heel to her red bow on the tongue, your favourite super-cute cartoon character joins your journey."
    },
    {
      "id": 19,
      "name": "PG 6 EP",
      "type": "Shoes",
      "rating": 5,
      "color": ["white","yellow","green","black"],
      "sale_price": 121,
      "price": 159,
      "image": "PG_6_EP.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Paul George does it all on the court, comfortably. He can take it to the hole, drive and dish, catch and shoot—always smooth, frequently devastating. Made from plush materials, his signature PG 6 EP is designed to feel light and buoyant, like you're walking on clouds."
    },
    {
      "id": 20,
      "name": "Nike Air Max Terrascape 97",
      "type": "Shoes",
      "rating": 2,
      "color": ["white","yellow","green","red"],
      "sale_price": 0,
      "price": 125,
      "image": "Nike_Air_Max_Terrascape_97.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Looking to nature for inspiration, the Nike Air Max Terrascape 97 lets you push your style full speed ahead. Made from at least 20% recycled materials by weight and with added durability (check out the reinforced mudguard), no detail is overlooked. Upping the ante, durable plastic in high-wear areas features speckled Nike Grind for a playful look."
    },
    {
      "id": 21,
      "name": "Nike Air Zoom Infinity Tour NXT",
      "type": "Shoes",
      "rating": 4,
      "color": ["white","blue","red"],
      "sale_price": 55,
      "price": 86,
      "image": "Nike_Air_Zoom_Infinity_Tour_NXT.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "We listened to your feedback on the Infinity Tour, refined it and brought it to life on the Nike Air Zoom Infinity Tour NXT%. We increased the overall volume to give your foot more room. We put 2 extra-large Zoom Air units in the forefoot for even more energy transfer through your swing. And we added more traction in key areas to help reduce slipping. The result is an incredibly responsive, comfortable shoe with design details inspired by a legendary golf course."
    },
    {
      "id": 22,
      "name": "Nike Air Force 1 '07 LV8 EMB",
      "type": "Shoes",
      "rating": 3,
      "color": ["white","blue","green"],
      "sale_price": 0,
      "price": 90,
      "image": "Nike_Air_Force_1_'07_LV8_EMB.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The radiance lives on with the b-ball original. Crossing hardwood comfort with off-court flair, it puts a fresh spin on what you know best: era-echoing, '80s construction, bold details and nothin'-but-net style."
    },
    {
      "id": 23,
      "name": "Nike Air Force 1 Mid '07 LX",
      "type": "Shoes",
      "rating": 5,
      "color": ["black"],
      "sale_price": 60,
      "price": 90,
      "image": "Nike_Air_Force_1_Mid_'07_LX.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Let your rebellious spirit shine through in the Air Force 1 Mid '07 LX. Crisp synthetic leather overlays, bold accents and the perfect amount of flash lend this streetwear staple a bit of edge. Expressive details on the insoles add a hint of attitude, while the padded, mid-cut collar and classic hook-and-loop closures bring heritage b-ball comfort."
    },
    {
      "id": 24,
      "name": "Vast Grey",
      "type": "Shoes",
      "rating": 3,
      "color": ["grey"],
      "sale_price": 200,
      "price": 210,
      "image": "Vast_Grey.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Stare into the grey and this Dunk Low may emerge. Dressed in contrasting hues of Vast Grey, Summit White, Peal White and Light Bone, this makeup is meant for keeping your style low-key, but fresh this season. It's a colourway so neutral—yet present, thanks to classic Dunk stylings—that it goes with anything. The all-over suede upper adds a premium, cosy touch to a Dunk Low that's ready to step out of the void and complete your fit."
    },
    {
      "id": 25,
      "name": "Nike Dunk High Retro Premium EMB",
      "type": "Shoes",
      "rating": 4,
      "color": ["orange","white"],
      "sale_price": 150,
      "price": 180,
      "image": "Nike_Dunk_High_Retro_Premium_EMB.jpg",
      "sizes": [
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Get Dunked. Your hoops icon gets done up with a basketball-like texture and twin pins that represent the WNBA and NBA. Wear the pins on your shoes, hat or wherever fits your style for the day."
    },
    {
      "id": 26,
      "name": "Nike React Miler 3",
      "type": "Shoes",
      "rating": 5,
      "color": ["red","black","white"],
      "sale_price": 150,
      "price": 180,
      "image": "Nike_React_Miler_3.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Cushioned and comfortable, just like every run should feel. The Nike React Miler 3 gives you a soft and smooth ride as your feet hit the pavement. We added stability in the heel for a secure sensation, while durable traction helps keep you going on runs long and short."
    },
    {
      "id": 27,
      "name": "Nike Air Max Excee",
      "type": "Shoes",
      "rating": 4,
      "color": ["orange","white"],
      "sale_price": 180,
      "price": 200,
      "image": "Nike_Air_Max_Excee.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Inspired by the Nike Air Max 90, the Nike Air Max Excee is a celebration of a classic through a new lens. Elongated lines and distorted proportions on the upper bring the '90s look you love into a new, modern space."
    },
    {
      "id": 28,
      "name": "Nike Overbreak",
      "type": "Shoes",
      "rating": 5,
      "color": ["orange","white"],
      "sale_price": 80,
      "price": 90,
      "image": "Nike_Overbreak.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Merging the iconic BRS athletics aesthetic with hyper-modern Nike OverReact details, the Nike Overbreak delivers head-turning style and comfort.Synthetic overlays mix with textile materials for added sophistication.Thick laces and foam exaggerate your expression."
    },
    {
      "id": 29,
      "name": "Kyrie Infinity EP",
      "type": "Shoes",
      "rating": 4,
      "color": ["blue","white","orange"],
      "sale_price": 0,
      "price": 80,
      "image": "Kyrie_Infinity_EP.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "The faster Kyrie slows down, the quicker he can speed up or change direction. His ability to control his movement keeps defenders guessing—and him in control. The Kyrie Infinity EP provides a cushioned, custom fit and traction up the sides, allowing players to accelerate and decelerate on demand and take advantage of the separation they create."
    },
    {
      "id": 30,
      "name": "Nike Tiempo Legend 9 Academy TF",
      "type": "Shoes",
      "rating": 4,
      "color": ["red","black"],
      "sale_price": 100,
      "price": 150,
      "image": "Nike_Tiempo_Legend_9_Academy_TF.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "1 of our lightest Tiempos to date, the Nike Tiempo Legend 9 Academy TF lets you go on the offensive with a low-profile design that's reinvented for attackers. The upper features raised areas throughout the strike zone for precise dribbling, passing and shooting, while a rubber sole helps supercharge traction on turf."
    },
    {
      "id": 31,
      "name": "Nike Defy All Day",
      "type": "Shoes",
      "rating": 5,
      "color": ["white","black"],
      "sale_price": 110,
      "price": 120,
      "image": "Nike_Defy_All_Day.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Take on everyday challenges in the Nike Defy All Day. Leather up top and rubber traction on the bottom create a durable design that lasts the rigours of tough training sessions. Soft cushioning carries comfort through your workout—or a day of getting things done."
    },
    {
      "id": 32,
      "name": "Nike Air Pegasus 83 Premium",
      "type": "Shoes",
      "rating": 5,
      "color": ["brown"],
      "sale_price": 120,
      "price": 150,
      "image": "Nike_Air_Pegasus_83_Premium.jpg",
      "sizes": [
        5.5,
        6,
        6.5,
        7,
        7.5
      ],
      "quantity": 0,
      "desc": "Travel first class without reservations in the Nike Air Pegasus 83 Premium—the callback classic. With a splash of running history, a dash of retro and a whole lot of comfort, it's your go-to for tried and tested. A mix of materials are easy to style while plush padding around the ankle keeps it feeling like your favourite armchair. You don't need a plane to take you places. Just lace up and arrive looking fresh."
    }
  ]
}